{
	"Project Alpha": "Projet Alpha",
	"An open-source project focused on AI development.": "Un projet open-source axé sur le développement de l'IA.",
	"DevConnect": "DevConnect",
	"A social platform for developers to connect and share ideas.": "Une plateforme sociale pour que les développeurs se connectent et partagent des idées.",
	"CodeStream": "CodeStream",
	"A collaborative coding environment for remote teams.": "Un environnement de codage collaboratif pour les équipes distantes.",
	"BugTracker": "BugTracker",
	"A tool to help teams track and manage software bugs.": "Un outil pour aider les équipes à suivre et à gérer les bogues logiciels.",
	"Docsify": "Docsify",
	"A lightweight documentation generator for projects.": "Un générateur de documentation léger pour les projets.",
	"TaskMaster": "TaskMaster",
	"A project management tool designed for agile teams.": "Un outil de gestion de projet conçu pour les équipes agiles.",
	"Contributors": "Contributors",
	"Join the community of passionate developers": "Rejoignez la communauté des développeurs passionnés",
	"Welcome to DevSocial": "Welcome to DevSocial",
	"DevSocialNetwork": "DevSocialNetwork",
	"Home": "Accueil",
	"Sign Up": "S'inscrire",
	"Sign In": "Se connecter",
	"language_fr": "Français",
	"language_en": "English",
	"Discover projects, share your code and collaborate with other developers.": "Découvrez des projets, partagez votre code et collaborez avec d'autres développeurs.",
	"You must be logged in with a valid account to see the different projects.": "Vous devez être connecté avec un compte validé pour voir les différents projets.",
	"Username": "Identifiant",
	"Email": "Email",
	"GitHub Profile URL": "Url de votre GitHub",
	"Password": "Mot de passe",
	"Login": "Connexion",
	"My Profile": "Mon Profil",
	"Incorrect identification": "Identification incorrecte",
	"Your Profile Information": "Informations de votre profil",
	"Username:": "Nom d'utilisateur :",
	"Email:": "E-mail :",
	"First Name:": "Prénom :",
	"Last Name:": "Nom de famille :",
	"Join Date:": "Date d'inscription :",
	"GitHub URL:": "URL GitHub :",
	"Update GitHub": "Mettre à jour GitHub",
	"Edit Profile": "Modifier le profil",
	"Change Password": "Changer le mot de passe",
	"GitHub Profile URL:": "URL du profil GitHub :",
	"Profile": "Profil",
	"see the github of": "voir le GitHub de",
	"Edit github link": "Modifier le lien GitHub",
	"Our administrator does not easily validate accounts, but he will regularly check your profile.": "Notre administrateur ne valide pas facilement les comptes, mais il passera régulièrement voir votre profil.",
	"Once your account is activated, you will need to log in again for the activation to take effect.": "Une fois votre compte activé, vous devrez vous reconnecter pour que l'activation soit prise en compte.",
	"The profile will be activated by the administrator.": "The profile will be activated by the administrator.",
	"Well done, the FLAG is:": "Bien joué le Flag est:",
	"Invalid username. It must contain between 3 and 40 characters." : "Nom d'utilisateur invalide. Il doit contenir entre 3 et 40 caractères.",
	"Invalid email.": "Email invalide.",
	"Password too short. It must contain at least 6 characters." : "Mot de passe trop court. Il doit contenir au moins 6 caractères.",
	"GitHub link too long.": "Lien GitHub trop long.",
	"Server error": "Erreur du serveur",
	"This username or email already exists in our database": "Ce nom d'utilisateur ou l'email existe déjà dans notre base de données",
	"You are now authenticated.": "Vous êtes maintenant authentifié.",
	"An error has occurred.": "Une erreur est survenue.",
	"Your modification has been taken into account.": "Votre modification a été prise en compte.",
	"You must be authenticated to access this page.": "Vous devez être authentifié pour accéder à cette page.",
	"You must be an administrator to access this page.":"Vous devez être administrateur pour accéder à cette page.",
	"You are now diconnected.":"Vous êtes maintenant déconnecté.",
	"You do not need to be authenticated to access this page.": "Vous ne devez pas être authentifié pour accéder à cette page.",
	"You are now registered." : "Vous êtes maintenant inscrit.",
	"Validate User": "Valider l'utilisateur",
	"Please wait, the challenge is loading!": "Merci de patienter, le challenge est en cours de chargement !",
	"Disconnect":"Déconnexion"
}